:PROPERTIES:
:ID:       45ccc897-f07c-4adc-9142-9ae8870fbddc
:END:
#+TITLE: Half-Cauchy distribution
#+CREATED: [2022-02-14 Mon 16:17]
#+LAST_MODIFIED: [2022-08-31 Wed 13:20]

- tags :: [[id:accc4a58-2f96-42da-a43d-c8140996d0d3][Probability distribution]]

The half-Cauchy is defined on $R^+$ and is [[id:31c8e78e-892c-4a73-b5d1-1d9b2e8a7fa7][Cauchy distributed]] on this domain. It can also be interpreted as a mixture of inverse gamma distributions[]]. In other words:

#+begin_src latex :results raw :exports results
\begin{equation*}
  X \sim \operatorname{C}^{+}(0, a)
\end{equation*}
#+end_src

#+RESULTS:
\begin{equation*}
  X \sim \operatorname{C}^{+}(0, a)
\end{equation*}

is equivalent to

#+begin_src latex :results raw :exports results
\begin{align*}
  X^{2} &\sim  \operatorname{InverseGamma}(1/2,\, 1/\xi)\\
  \xi &\sim \operatorname{InverseGamme}(1/2,\, 1/a^2)
\end{align*}
#+end_src

#+RESULTS:
\begin{align*}
  X^{2} &\sim  \operatorname{InverseGamma}(1/2,\, 1/\xi)\\
  \xi &\sim \operatorname{InverseGamme}(1/2,\, 1/a^2)
\end{align*}

* References

- High-Dimensional Bayesian Regularised Regression with the BayesReg Package ([[https://arxiv.org/abs/1611.06649][ArXiv]])
